[
  {
    "name": "Kickoff Party",
    "venue": "Nashville Software School",
    "venue_description": "Nashville Software School (NSS) is a place where a person with aptitude, motivation, passion and commitment can learn the craft of software development. Our intensive training and apprenticeship program dramatically accelerates learning about and access to the world of programming. Give us six months and we'll prepare you for a job as a junior-level web developer.",
    "venue_img": "/img/venues/nss.png",
    "venue_url": "http://nashvillesoftwareschool.com/",
    "parking_instructions": "",
    "event_description": "The Kickoff Party for Nodevember 2017 is happening at Nashville Software School with the help of Nashville’s Board Gamers User Group. Join us for snacks, drinks, and shenanigans as we prepare for 2 days of Javascript fun.",
    "schedule": [
      "Sunday Night 6-9pm"
    ],
    "eventbrite_url": "https://nodevember.eventbrite.com"
  },
  {
    "name": "Keynote Sessions",
    "venue": "Vanderbilt Student Life Center Commodore Ballroom",
    "venue_img": "/img/venues/commodore.jpg",
    "venue_url": "https://www.vanderbilt.edu/studentcenters/explore/floor-1/",
    "venue_description": "The Commodore Ballroom comprises nearly all of the first level of the Student Life Center, and can be subdivided into three equal spaces.  With adjoining catering space, the 9,000 square foot Commodore Ballroom is able to accommodate dances, dinners and other large social functions.",
    "parking_instructions": "",
    "event_description": "Nodevember 2017 offers 4 keynotes. Keynotes are hour long addresses that take place in Vanderbilt’s Commodore Ballroom. There will be an opening and closing keynote each day of the conference. Opening and closing remarks (including general housekeeping issues) will accompany keynotes sessions.",
    "schedule": [
      "Morning: Monday and Tuesday, 9-10:15am",
      "Afternoon: Monday and Tuesday, 4:50-6pm"
    ],
    "eventbrite_url": "https://nodevember.eventbrite.com"
  },
  {
    "name": "General Sessions",
    "venue": "Vanderbilt Student Life Center",
    "venue_img": "/img/venues/student-life-center.jpg",
    "venue_url": "https://www.vanderbilt.edu/studentcenters/explore/floor-1/",
    "venue_description": "The Vanderbilt Student Life Center features over 18,000 square feet of event space, the Center for Student Professional Development, Vanderbilt International Office, Global Education Office, and International Student and Scholar Services. The $11.4 million project was completed in the spring of 2005. The Grand Opening was March 30-April 2, 2005.",
    "parking_instructions": "",
    "event_description": "There will 34 General Sessions for Nodevember 2017. General Sessions are 30 minutes each and will take place in Vanderbilt’s Student Life Center. 20 minutes are given between each session to allow for time to get to the next session, or to participate in the ever popular \"hallway track\".",
    "schedule": [
      "Monday and Tuesday 10:30am - 4:30pm"
    ],
    "eventbrite_url": "https://nodevember.eventbrite.com"
  },
  {
    "name": "Workshops",
    "venue": "Vanderbilt Sarratt Student Center",
    "venue_img": "/img/venues/sarratt.jpg",
    "venue_url": "https://www.vanderbilt.edu/studentcenters/explore/virtual-tour/",
    "venue_description": "Sarratt Student Center reflects the product of four distinct phases of construction. Rand Dining Hall was built in 1952, its location central to Vanderbilt Campus. In 1974, Sarratt was erected in the form of two buildings — the cinema/art gallery, and the Glove Lounge/Overcup Oak — joined by an elevated walkway, under which students could pass to reach Rand. The dining hall and bookstore were rebuilt and expanded in 1986 at a cost of $6 million. In 2000, the 56,000-square-foot Sarratt complex received an 18,000-square-foot expansion in the form of the enclosed Promenade and the 3rd floor Skylight. Student complaints of Sarratt's being confusingly arranged, poorly lit and visually unnerving were addressed by joining the 3 separate Rand/Sarratt buildings into the single large structure of today.",
    "parking_instructions": "",
    "event_description": "Offering Workshops the same day as the main conference is new for Nodevember this year! In Vanderbilt’s Sarratt Center there will be one Workshop each day after lunch. Workshops are approximately 3 hours in length and can accommodate 50 attendees.",
    "schedule": [
      "Monday and Tuesday afternoon, 1:30-4:30pm"
    ],
    "eventbrite_url": "https://nodevember.eventbrite.com"
  },
  {
    "name": "Open Spaces",
    "venue": "Vanderbilt Sarratt Student Center",
    "venue_img": "/img/venues/sarratt.jpg",
    "venue_url": "https://www.vanderbilt.edu/studentcenters/explore/virtual-tour/",
    "venue_description": "Sarratt Student Center reflects the product of four distinct phases of construction. Rand Dining Hall was built in 1952, its location central to Vanderbilt Campus. In 1974, Sarratt was erected in the form of two buildings — the cinema/art gallery, and the Glove Lounge/Overcup Oak — joined by an elevated walkway, under which students could pass to reach Rand. The dining hall and bookstore were rebuilt and expanded in 1986 at a cost of $6 million. In 2000, the 56,000-square-foot Sarratt complex received an 18,000-square-foot expansion in the form of the enclosed Promenade and the 3rd floor Skylight. Student complaints of Sarratt's being confusingly arranged, poorly lit and visually unnerving were addressed by joining the 3 separate Rand/Sarratt buildings into the single large structure of today.",
    "parking_instructions": "",
    "event_description": "Open Spaces and Lightning Talks are new for Nodevember! Vanderbilt’s Sarratt Center will host this part of the conference in the mornings. Sign up for lightning talks will begin at registration. Open Spaces will be guided group discussions.",
    "schedule": [
      "Monday and Tuesday Mornings, 10:30am-noon"
    ],
    "eventbrite_url": "https://nodevember.eventbrite.com"
  },
  {
    "name": "After Party",
    "venue": "Ruby Nashville",
    "venue_img": "/img/venues/ruby.png",
    "venue_url": "http://rubynashville.com/",
    "venue_description": "Ruby is a boutique Nashville event venue surrounded by Dragon Park in the historic Hillsboro Village neighborhood. Open to private events - including wedding ceremonies and receptions, corporate/ non-profit parties, and music occasions, Ruby blends the historic with an industrial, contemporary design and an appreciation for outdoor spaces.  Ruby is an oasis in vibrant Vanderbilt / Midtown.",
    "parking_instructions": "",
    "event_description": "Nodevember 2017 will wrap up at the beautiful Ruby Nashville, walking distance from the conference. Join us for drinks, music, and discussions on our favorite Nodevember moments.",
    "schedule": [
      "Tuesday Night, 7-10pm"
    ],
    "eventbrite_url": "https://nodevember.eventbrite.com"
  }
]