[
  {
    "name": "Ben Ilegbodu",
    "avatar": "/img/speakers/ben-ilegbodu.jpg",
    "location": "Pittsburg, CA",
    "bio": "Ben is a Christian, a husband and a father of 2 with 10+ years of experience developing user interfaces for the Web. He currently manages the team at Eventbrite focused on making Eventbrite THE destination for finding events and other things to do. On the side, Ben also enjoys playing basketball, DIY, watching movies, and blogging (benmvp.com) / tweeting (@benmvp) about his experiences with new web development technologies.",
    "talk_format": "Talk (~30-45 minutes)",
    "twitter": "benmvp",
    "url": "http://www.benmvp.com/",
    "organization": "Eventbrite",
    "title": "Why choose React?",
    "abstract": "New to React and want to learn a little about how it works? Seeking ammunition to convince your team to make the change? Come learn about _why_ we made the decision to transition to React, through an intro of _how_ to build user interactions with React.",
    "description": "As the Frontend Platform team at Eventbrite switched from Backbone over to React, it had to convince other developers, managers, directors and non-engineers that React was the right path. And the rationale for moving wasn’t just because React is insanely popular. There are many tangible benefits that make the effort of migrating worthwhile.\r\n \r\nNew to React and want to learn a little about how it works? Seeking ammunition to convince your team to make the change? Come learn about why we made the decision to transition to React, through an intro of how to build user interactions with React.",
    "audience_level": "All",
    "tags": ["javascript", "react"],
    "state": "accepted",
    "confirmed": false,
    "created_at": "2017-06-21T05:32:15.829Z"
  },
  {
    "name": "Aimee Knight",
    "avatar": "/img/speakers/aimee-knight.jpg",
    "location": "Nashville, TN",
    "bio": "Aimee Knight is a former competitive figure skater, graduate of the Nasvhille Software School, and software engineer at DramaFever, a subsidiary of Warner Bros. Outside of work, she’s a weekly panelist on the JavaScript Jabber podcast, and she regularly participate in a variety others. In her spare time she loves speaking at conferences, playing with new technology, running, lifting weights, and trying new flavors of Kombucha!",
    "talk_format": "Talk (~30-45 minutes)",
    "twitter": "Aimee_Knight",
    "url": "http://aimeemarieknight.com/",
    "organization": "DramaFever/Warner Bros.",
    "title": "It's Not Dark Magic - Pulling Back the Curtains From Your Stylesheets",
    "abstract": "JavaScript developers are often puzzled when CSS renders in unexpected ways. It’s not dark magic though. This talk focuses on why CSS behaves the way it does. We'll deep diving into browser internals to see how CSS is parsed and rendered so we can debug our styles just like we do our JavaScript.",
    "description": "Chances are if you're a JavaScript developer you're also writing CSS. When you first looked at CSS it probably seemed like a breeze. You added some border here, changed some background colors there. JavaScript was the hard part! Somewhere during your progression as a JavaScript developer that changed though! What's worse is that many of us have simply learned to dismiss CSS as a toy language. The truth, however, is that when we hit a wall many of us don’t actually know how to debug our styles sheets like we do our JavaScript!\r\n\r\nWe all like to make jokes about it, but how many of us have actually taken the time to try and understand the CSS we're writing. How many of us have actually reasonably debugged an issue to the next lowest abstraction layer when we hit a wall? All too often we settle for the first StackOverflow answer, hacks, or we just let the issue go entirely.\r\n\r\nIn this talk, we're going to finally take a step back and stop mindlessly throwing darts at the dart board! We’ll discuss the most common issues JavaScript developers face such as, z-index, the cascade, and positioning in depth by diving deep into the browser's internal rendering engine structure to see how our styles are parsed and rendered. Sure, you may still not have an eye for design, but you might just walk away a CSS guru!",
    "audience_level": "All",
    "tags": ["frontend"],
    "state": "accepted",
    "confirmed": true
  },
  {
    "name": "Laurie Voss",
    "avatar": "/img/speakers/laurie-voss.jpg",
    "location": "San Francisco, CA",
    "bio": "Laurie is the co-founder and COO of npm, Inc., and has been a web developer of various flavors for over 20 years, since before JavaScript even existed. He cares about making websites big and fast, and wants web development to be as accessible to everyone as it possibly can be.",
    "talk_format": "Talk (~30-45 minutes)",
    "twitter": "seldo",
    "url": "http://www.seldo.com",
    "organization": "npm Inc.",
    "title": "Welcome to the new npm",
    "abstract": "Sure, you use npm install, but have you heard about npm 5 and all the new stuff it can do? What about npx? Have you integrated lock files into your workflow? Have you got your multi-module workflow down? Whether you're new to npm or an old-timer, let npm fill you in on what's new and what's next.",
    "description": "npm has over 9 million users, and more than half of them started using npm less than a year ago. That means there are a ton of people who've just scratched the surface of what npm can do: npm install is easy to use, but npm has hidden depths. npm sits at the center of modern web development, and JavaScript development in general, and we get a lot of insight into what people are doing with npm and how they're using it. This talk guides new users through the basics, and introduces old-timers to the big changes and workflow enhancements that came with npm 5 and npx.",
    "audience_level": "All",
    "tags": ["npm", "javascript", "web development"],
    "state": "accepted",
    "confirmed": true,
    "created_at": "2017-08-09T19:35:36.297Z"
  },
  {
    "name": "Kim Crayton",
    "avatar": "https://s3.amazonaws.com/nodevember-expo/kim.jpg",
    "location": "Atlanta, GA",
    "bio": "Kim, is a Community Engineer and advocate for diversity, inclusion, and safe spaces in tech. She has years of experience working with learners of all ages, skill level, and abilities and is now using her knowledge to develop technical people, ideas, organizations, and communities. Her current efforts focus on creating environments that support the safe sharing of common attitudes, interests, and goals, which she is doing with \"The Community Engineering Report\" podcast (@CommEngReport), \"Taming the Wild West: Strategies For Successfully Transitioning Into A Technology Career\" workshop, public speaking, and #WeCanDoBetter. She is currently pursuing a Doctor's of Business Administration - Technology Entrepreneurship",
    "talk_format": "Talk (~30-45 minutes)",
    "twitter": "KimCrayton1",
    "url": "http://www.KimCrayton.com/",
    "organization": "Kim Crayton LLC",
    "title": "What is Community Engineering?",
    "abstract": "Community Engineering - Is the intentional and skillful effort of creating environments which support the sharing of common attitudes, interests, and goals in order to grow a more diverse and inclusive technology community. ",
    "description": "Since technology now literately touches almost everyone and it is no longer the playground of just a few, it isn’t economically prudent to build products and services that don’t reflect the needs and desires of large portions of the population. So it makes sense that technology communities are now focused on attracting a  more inclusive and diverse membership. \r\n\r\nYet, all too often, efforts for creating more inclusive communities are not successful because of 3 major assumptions held by community members: \r\n1. “They know who we are”\r\n2. “They know what we do”\r\n3. “They will figure it out”\r\n\r\nLet’s explore strategies that can be used to overcome the obstacles related to the 3 assumptions standing in the way of community growth.\r\n\r\nLearning Outcomes:\r\n- Understanding the difference between diversity and inclusion and why both are important\r\n- Knowing your audience. The goals and perspectives of the community may not be that of the intended members and how to find common ground\r\n- Understanding the importance of putting your resources where your mouth is\r\n- Being able to overcome the inherent mistrust that many underrepresented communities have with established structure and individuals",
    "audience_level": "All",
    "tags": ["entertaining", "community", "inclusion", "diversity", "strategies", "technology", "open", "welcoming", "communication", "strategy", "best practices", "measurable outcomes", "culture"],
    "state": "accepted",
    "confirmed": true,
    "created_at": "2017-06-08T02:15:53.553Z"
  }
]
