[
  {
    "company": "Ruby",
    "twitter": "RubyNashville",
    "logo": "/img/sponsors/ruby.png",
    "url": "http://rubynashville.com/",
    "description": "Ruby is a boutique Nashville event venue surrounded by Dragon Park in the historic Hillsboro Village neighborhood. Open to private events - including wedding ceremonies and receptions, corporate/ non-profit parties, and music occasions, Ruby blends the historic with an industrial, contemporary design and an appreciation for outdoor spaces.  Ruby is an oasis in vibrant Vanderbilt / Midtown.",
    "level": "Community"
  },
  {
    "company": "GitKraken",
    "twitter": "GitKraken",
    "logo": "/img/sponsors/gitkraken.png",
    "url": "https://www.gitkraken.com/",
    "description": "Axosoft GitKraken is a cross-platform Git client with efficiency, elegance and reliability at the core. It was made for devs by devs.",
    "level": "Community"
  },
  {
    "company": "Reax",
    "twitter": "reaxdotio",
    "logo": "/img/sponsors/reax.png",
    "url": "https://www.reax.io/",
    "description": "We are a custom software solutions provider based in Nashville, Tennessee. We collaborate with our partners to solve difficult problems using agile methodologies and creative solutions. We embrace collaboration within our agency and with our clients. Our developers work closely with our clients through an iterative, agile process. We believe that being accessible and transparent is the approach needed to deliver great work.",
    "level": "Silver"
  },
  {
    "company": "Interactive Resources",
    "twitter": "IR_talent",
    "logo": "/img/sponsors/interactive-resources.png",
    "url": "http://www.IRtalent.com",
    "description": "Interactive Resources specializes in technical, professional and industrial workforce solutions. Our team consists of highly talented business professionals, who are constantly striving to exceed the expectations of both our job seekers and our business partners. We have demonstrated knowledge of our local markets and we provide custom solutions that best fit our customers’ individual needs. At Interactive Resources, we pride ourselves on the power of strong relationships – we are the partner you keep.",
    "level": "Silver"
  },
  {
    "company": "Healthcare Bluebook",
    "twitter": "HCBlueBook",
    "logo": "/img/sponsors/hcbb.png",
    "url": "http://www.healthcarebluebook.com",
    "description": "We take the mystery out of healthcare by showing the huge cost and quality differences among providers.",
    "level": "Bronze"
  },
  {
    "company": "StayWell",
    "twitter": "StayWellTweets",
    "logo": "/img/sponsors/staywell.png",
    "url": "http://www.staywell.com",
    "description": "StayWell is a health engagement company that helps its clients engage and educate people to improve health and business results. <br />We bring decades of experience working across the health care industry to design solutions that address our clients’ evolving needs.<We fuse expertise in health engagement and the science of behavior change with an integrated portfolio of solutions and robust content assets. Our customizable programs are proven to effectively engage people to make positive health care decisions—across even the most challenging populations.",
    "level": "Bronze"
  },
  {
    "company": "Meeple Mountain",
    "twitter": "meeplemountain",
    "logo": "/img/sponsors/meeple-mountain.png",
    "url": "http://www.meeplemountain.com",
    "description": "Meeple Mountain is a board game media outlet and Nashville based board game event organizer. Our goal is to promote online and in-person communities by providing excellent board gaming experiences to gamers and non-gamers alike.",
    "level": "Community"
  },
  {
    "company": "Nashville Software School",
    "twitter": "NashSoftware",
    "logo": "/img/sponsors/nss.png",
    "url": "http://www.nashvillesoftwareschool.com",
    "description": "Nashville Software School (NSS) is Nashville’s nonprofit vocational school that prepares adults for careers in technical fields like software development, UI/UX design, and data science. NSS is a place where a person with aptitude, motivation, and commitment can learn a new craft or build on their existing skills. NSS is committed to growing diversity in technology by opening the door to underrepresented groups in tech irrespective of their economic situation. By providing a hands-on, project and team-based learning environment that mirrors the real-world environment, graduates leave with knowledge that is applicable on the first day of their job. One of the first coding bootcamps in the country, NSS has graduated 475 software developers since 2012.",
    "level": "Silver"
  },
  {
    "company": "npm",
    "twitter": "npmjs",
    "logo": "/img/sponsors/npm.png",
    "url": "http://www.npmjs.com",
    "description": "npm is the package manager for JavaScript and the world's largest software registry. npm's security, hosting, and team management products support millions of developers at hundreds of thousands of companies worldwide as they find, share, and re-use code to build amazing things.",
    "level": "Community"
  },
  {
    "company": "fly.io",
    "twitter": "flydotio",
    "logo": "https://s3.amazonaws.com/nodevember-expo/flyio.png",
    "url": "https://fly.io/",
    "description": "Fly brings the untapped potential of intelligent edge-servers to your finger-tips. It's a global load balancer, a smart reverse proxy, a library of powerful Middleware; it's a CDN that developers like you control.",
    "level": "Bronze"
  },
  {
    "company": "Netlify",
    "twitter": "Netlify",
    "logo": "/img/sponsors/netlify.png",
    "url": "https://www.netlify.com/",
    "description": "The all-in-one toolset that automates the build and deploy process for modern web projects.",
    "level": "Silver"
  },
  {
    "company": "Heroku",
    "twitter": "heroku",
    "logo": "https://s3.amazonaws.com/nodevember-expo/heroku.png",
    "url": "https://www.heroku.com/",
    "description": "Heroku, a Salesforce company and industry pioneer in platform as a service (PaaS), enables developers to build and run applications entirely in the cloud, without the need to purchase or maintain any servers or software. Over 8 million apps, including ones from Product Hunt, Casper and Citrix run on Heroku. With support for the most popular languages such as Ruby and Node.js, high-scale data services including Postgres, Redis and Kafka, and an add-ons ecosystem featuring over 150 cloud application services, Heroku provides companies from startups to Fortune 500 enterprises with a faster and more effective way to create, deploy and manage beautiful apps in the cloud.",
    "level": "Diamond"
  },
  {
    "company": "Microsoft",
    "twitter": "Microsoft",
    "logo": "/img/sponsors/microsoft.png",
    "url": "https://www.microsoft.com/",
    "description": "Microsoft is dedicated to inspiring and empowering developers everywhere. Explore our developer tools, platforms, and API’s at docs.microsoft.com and see what you can build with Microsoft tech, CODE ON!",
    "level": "Gold"
  },
  {
    "company": "NodeSource",
    "twitter": "NodeSource",
    "logo": "https://s3.amazonaws.com/nodevember-expo/nodesource.png",
    "url": "https://nodesource.com/",
    "description": "",
    "level": "Silver"
  },
  {
    "company": "MedForward",
    "twitter": "medforward",
    "logo": "/img/sponsors/medforward.png",
    "url": "https://www.medforward.com/",
    "description": "MedForward is the leading provider for HIPAA compliant secure online medical forms. MedForward offers a hosted and fully managed solution that includes an online form editor with PDF mapping and responsive form capabilities. The feature rich solution allows hospitals and private practices across the country to streamline the patient intake process.",
    "level": "Community"
  },
  {
    "company": "TechFed Nashville",
    "twitter": "techfednash",
    "logo": "/img/sponsors/tfn_logo_horizontal.png",
    "url": "http://techfednashville.org/",
    "description": "TechFed Nashville is a non-profit organization dedicated to supporting and growing the grassroots tech talent in Middle Tennessee through educational events and groups. We provide financial stewardship, risk management and volunteer leadership development for conferences, user groups and meetups. Join TechFed to discover opportunities to learn, share and connect.",
    "level": "Community"
  },
  {
    "company": "Eventbrite",
    "twitter": "Eventbrite",
    "logo": "/img/sponsors/eventbrite.png",
    "url": "https://www.eventbrite.com/",
    "description": "",
    "level": "Silver"
  },
  {
    "company": "Ingram Content Group",
    "twitter": "IngramContent",
    "logo": "/img/sponsors/vitalsource.png",
    "url": "https://www.ingramcontent.com/",
    "description": "",
    "level": "Silver"
  }
]